Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/back_to_education/social_welfare_payments_and_the_student_maintenance_grant_for_the_2010_11_academic_year.html.txt.tmx
Source language: en
Languages: ga

source: Social welfare payments and the student grant
ga: Íocaíochtaí leasa shóisialaigh agus an deontas mac léinn

source: If you are returning to education and have been getting a social welfare payment you may qualify for the Back to Education Allowance or the student grant depending on your circumstances
ga: Más ag filleadh ar oideachas atá tú agus má bhí íocaíocht leasa shóisialaigh á fáil agat, d’fhéadfá cáiliú don Liúntas um Fhilleadh ar Oideachas nó don scéim um dheontais do mhic léinn, ag brath ar do chuid cúinsí

source: You cannot get the Back to Education Allowance (BTEA) and a full student grant at the same time
ga: Ní féidir (i mórchuid na gcásanna) Liúntas um Fhilleadh ar Oideachas agus deontas iomlán mac léinn a fháil ag an tráth céanna

source: If you are getting One-Parent Family Payment (OFP), Jobseeker's Transitional payment, Disability Allowance, Invalidity Pension or Illness Benefit, you will need to assess whether it is more beneficial for you to transfer to the BTEA when you go back to education or to remain on your current payment and apply for a student grant
ga: Má tá Íocaíocht Teaghlach Aontuismitheora, Liúntas Míchumais, Pinsean Easláinte nó Sochar Breoiteachta á fháil agat, beidh ort a mheas an mbainfeá níos mó tairbhe as aistriú chuig an BTEA nuair a fhilleann tú ar oideachas nó chun fanacht agus d’íocaíocht reatha a fháil agus iarratas a dhéanamh ar dheontas mac léinn

source: Since 2015, if you are a new BTEA applicant and you were getting a jobseeker’s payment, Farm Assist, a One-Parent Family Payment or a Jobseeker's Transitional payment, you must re-establish your entitlement to a primary payment to continue to be entitled to BTEA for the second or subsequent years of study
ga: Má Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist á fháil agat, ní mór duit aistriú chuig an BTEA más mian leat íocaíocht leasa shóisialaigh a choimeád nuair a fhilleann tú ar an oideachas

source: This document outlines your options
ga: Tugtar sa cháipéis seo breac-chuntas ar do chuid roghanna

source: Back to Education Allowance
ga: Liúntas um Fhilleadh ar Oideachas

source: The Back to Education Allowance (BTEA) allows people getting certain social welfare payments to get a social welfare payment while participating in approved full-time courses in further and higher education
ga: Ligeann an Liúntas um Fhilleadh ar Oideachas (BTEA) do dhaoine ag a bhfuil íocaíochtaí leasa shóisialaigh íocaíocht leasa shóisialaigh a fháil fad a bhíonn páirt á glacadh acu i gcúrsaí lánaimseartha ceadaithe san ardoideachas agus sa bhreisoideachas

source: People taking part in the BTEA scheme are paid a weekly allowance equivalent to the social welfare payment they were getting before starting their course
ga: Íoctar le daoine a ghlacann páirt i scéim an BTEA liúntas seachtainiúil den mhéid céanna de ráta an LFO agus d’íocaíocht cosanta sóisialta roimhe seo

source: Students doing full-time higher education undergraduate/postgraduate courses and full-time Post Leaving Certificate Courses (PLCs) may get financial support through the means-tested Student Grant Scheme. Grant rates for qualifying students vary according to a number of factors, including household income, family size and whether the student's college is close to their permanent residence
ga: Is féidir le mic léinn a dhéanann cúrsaí lánaimseartha fochéime/iarchéime ardoideachais agus Cúrsaí lánaimseartha Iar-Ardteistiméireachta (PLCanna) tacaíocht airgeadais a fháil tríd an Scéim um Dheontais do Mhic Léinn a ndéantar tástáil mhaoine ina leith

source: From 2012 onwards, new postgraduate students do not qualify for a full student grant but they may qualify for a partial grant (see below) if they pass particular means tests
ga: Tagann athrú ar rátaí deontais do mhic léinn a cháilítear de réir líon tosca, lena n-áirítear ioncam teaghlaigh, méid an teaghlaigh agus cibé acu an bhfuil coláiste an mhic léinn gar dá n-áit bhunachónaithe nó a mhalairt

source: The maintenance grant is a contribution towards the student’s living costs
ga: Tá dhá chomhábhar sa scéim – deontas cothabhála agus deontas táillí

source: The fee grant can cover any of the following 3 elements: tuition fees, students contribution and cost of essential field trips. The postgraduate contribution may be payable to a postgraduate who passes a special means test
ga: Ranníocaíocht i dtreo chostais mhaireachtála an mhic léinn is ea an deontas cothabhála, agus is féidir leis an deontas táillí íoc as aon cheann de na 3 ghné a leanas: táillí teagaisc, ranníocaíocht na mac léinn agus as costas turas ríthábhachtach allamuigh

source: In general if you qualify for a maintenance grant you will also qualify for whatever elements of a fee grant apply to your situation
ga: Go ginearálta, má cháilítear thú don deontas cothabhála, cáileofar thú do pé gnéithe de dheontas táillí a bhaineann le do chás

source: Read more in our document on the Student Grant Scheme
ga: An deontas cothabhála agus an BTEA

source: You cannot get a maintenance grant and a BTEA or a VTOS allowance together
ga: Eisceachtaí: Má bhí an Liúntas um Fhilleadh ar Oideachas agus an deontas cothabhála mac léinn á bhfáil agat ag tús bhliain acadúil 2010, leanfaidh tú le bheith i dteideal an dá íocaíocht a fháil d’fhad iomlán do chúrsa reatha

source: If you have completed a course and now wish to progress to a course at a higher level, you can continue to retain your BTEA payment (generally up to and including level 8 on the National Framework of Qualifications)
ga: Má chríochnaigh tú cúrsa agus más mian leat anois leanúint ar aghaidh agus cúrsa ar ardleibhéal a dhéanamh, is féidir leat leanúint agus d’íocaíocht BTEA a choimeád (a fhad le leibhéal 8 ar an gCreat Náisiúnta Cáilíochtaí agus an leibhéal sin san áireamh)

source: However, you will no longer be entitled to the maintenance component of the student grant
ga: Ní bheidh tú i dteideal an comhábhar cothabhála den deontas mac léinn a fháil a thuilleadh, áfach

source: You can apply under the grant scheme to have the student contribution and any tuition fees/field trip costs paid on your behalf under the fee component of the student grant (if you qualify) and for a postgraduate fee contribution (if relevant)
ga: Is féidir leat iarratas a dhéanamh faoin scéim deontais go n-íocfar as ranníocaíocht an mhic linn agus as aon táillí teagaisc/chostais turas allamuigh ar do shon faoin gcomhábhar táillí den deontas mac léinn (má cháilítear thú)

source: If you are getting the BTEA you do not qualify for the maintenance component of the student grant but you can apply for a fee grant to cover the student contribution and any course tuition fees not already covered by the Free Fees Scheme
ga: Má tá an BTEA á fháil agat, ní cháilítear thú do chomhábhar cothabhála an deontais mhac léinn, ach is féidir leat iarratas a dhéanamh ar dheontas táillí chun íoc as ranníocaíocht an mhic léinn agus as aon táillí teagaisc den chúrsa nach gcuimsítear cheana féin faoin Scéim um Tháillí Saor in Aisce

source: Essential field trip costs may also be covered under a fee grant
ga: D’fhéadfaí costais turas ríthábhachtach allamuigh a chuimsiú faoi dheontas táillí

source: Please note, however, that people getting BTEA may not qualify for payment of a fee grant – unless they meet the terms and conditions of the student grant scheme
ga: Tabhair faoi deara, le do thoil, go dtarlódh nach bhfaigheadh daoine ag a bhfuil an BTEA á fháil le haghaidh íocaíocht deontas táillí – mura gcomhlíonann siad téarmaí agus coinníollacha na scéime deontas mac léinn

source: If you are getting the BTEA and wish to apply for these charges to be covered by a fee grant you should apply for a grant as soon as possible
ga: Má tá an BTEA á fháil agat agus más mian leat iarratas a dhéanamh go gcuimseofar na táillí seo faoi dheontas táillí, ba cheart duit foirm iarratais ar dheontas a chomhlánú a luaithe agus is féidir agus í a sheoladh chuig d’údarás áitiúil nó chuig do Choiste Gairmoideachais áitiúil

source: If you are doing a Post-Leaving Certificate (PLC) course and getting the BTEA or a VTOS allowance you are exempt from the student participant charge (€200)
ga: Má tá cúrsa Iar-Ardteistiméireachta (PLC) á dhéanamh agat, agus má tá an BTEA nó Liúntas VTOS á fháil agat, tá tú díolmhaithe ón muirear nua rannpháirtithe mac léinn (€200)

source: You may have to pay a course charge for books, exam fees and other costs
ga: B’fhéidir go mbeidh ort muirear cúrsa a íoc le haghaidh leabhar, táillí agus costais eile

source: Social welfare payments and the BTEA
ga: Íocaíochtaí leasa shóisialaigh agus an BTEA

source: If you are getting a One-Parent Family Payment, Jobseeker's Transitional payment or a disability payment (Disability Allowance, Invalidity Pension or Illness Benefit ) you can choose to stay on your current social welfare payment and apply for a student grant or you can choose to transfer to the BTEA
ga: Má tá Íocaíocht Teaghlach Aontuismitheora nó íocaíocht mhíchumais (Liúntas Míchumais, Pinsean Easláinte nó Sochar Breoiteachta) á fháil agat, is féidir leat a roghnú chun fanacht agus d’íocaíocht reatha leasa shóisialaigh a fháil agus iarratas a dhéanamh ar dheontas cothabhála mac léinn nó is féidir leat roghnú go n-aistreofar thú chuig an BTEA

source: You will need to assess whether it is more beneficial for you to transfer to the BTEA when you go back to education or to remain on your current payment and apply for a student grant
ga: Beidh ort a mheas cibé acu is tairbhiúla duit – aistriú chuig an BTEA nuair a fhilleann tú ar oideachas nó fanacht agus d'íocaíocht reatha a fháil agus iarratas a dhéanamh ar dheontas mac léinn

source: Further information on these two options is set out below
ga: Leagtar amach thíos tuilleadh faisnéise ar an dá rogha seo

source: If you are getting Jobseeker’s Benefit or Jobseeker’s Allowance, you will no longer meet the conditions of your payment if you go back to education (since you must be available for and seeking work)
ga: Má tá Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist á fháil agat, ní chomhlíonfaidh tú a thuilleadh coinníollacha d’íocaíochta má fhilleann tú ar oideachas (ós rud é nach mór fáil bheith ort le haghaidh oibre agus go mbíonn tú ag cuardach oibre)

source: This means that you must transfer to the BTEA if you wish to keep a social welfare payment when you go back to education – see ‘People getting Jobseeker’s Allowance or Benefit’ below
ga: Ciallaíonn seo nach mór duit aistriú chuig an BTEA más mian leat íocaíocht leasa shóisialaigh a choimeád nuair a fhilleann tú ar an oideachas – féach ‘Daoine a fhaigheann Liúntas nó Sochar Cuardaitheora Poist’

source: People getting One-Parent Family Payment, Jobseeker's Transitional payment, Disability Allowance, Invalidity Pension or Illness Benefit
ga: Daoine a fhaigheann Íocaíocht Teaghlach Aontuismitheora, Liúntas Míchumais, Pinsean Easláinte nó Sochar Breoiteachta

source: Option 1: Transfer to BTEA
ga: Rogha 1: Aistriú chuig an BTEA

source: If you transfer to BTEA, you will:
ga: Má aistríonn tú chuig an BTEA:

source: • Receive a payment equivalent to your current payment
ga: • Gheobhaidh tú íocaíocht ar chomhionann leis de d’íocaíocht reatha

source: • Not be eligible for maintenance under the student grant scheme
ga: • Ní bheidh tú i dteideal cothabháil a fháil faoin scéim um dheontais do mhic léinn

source: • Be able to apply under the student grant scheme for a fee grant to cover the student contribution and course fees/field trip costs (where appropriate)
ga: • Beidh tú in ann iarratas a dhéanamh faoin scéim um dheontais do mhic léinn ar dheontas táillí chun íoc as ranníocaíocht an mhic léinn agus as costais táillí cúrsa/turas allamuigh (sa chás cuí)

source: • Be able to start part-time work during the academic year without affecting your BTEA payment – provided the work does not affect your studies and college attendance
ga: • Beidh tú in ann oibriú go páirtaimseartha gan tionchar a imirt ar d’íocaíocht BTEA

source: • In general, retain secondary benefits like Rent Supplement
ga: • Go ginearálta, beidh tú in ann sochair thánaisteacha, ar nós Forlíonadh Cíosa a choimeád

source: Note: If you are in receipt of Rent Supplement and your income increases, you will be re-assessed for Rent Supplement
ga: Nóta: Má tá Forlíonadh Cíosa nó Forlíonadh Ús Morgáiste á fháil agat agus má mhéadaítear d’ioncam, déanfar athmheasúnú ort do na sochair seo

source: If you have a medical card, you are entitled to keep it while you are receiving BTEA
ga: Má tá cárta leighis agat, tá tú i dteideal é a choimeád fad atá an BTEA á fháil agat

source: Option 2: Continue to get your One-Parent Family Payment, Jobseeker's Transitional payment, Disability Allowance, Invalidity Pension or Illness Benefit
ga: Rogha 2: Leanúint agus d’Íocaíocht Teaghlach Aontuismitheora, Liúntas Míchumais, Pinsean Easláinte nó Sochar Breoiteachta a fháil

source: If you continue to get your One-Parent Family Payment, Jobseeker's Transitional payment, Disability Allowance, Invalidity Pension or Illness Benefit, you will:
ga: Má leanann tú agus d’Íocaíocht Teaghlach Aontuismitheora, Liúntas Míchumais, Pinsean Easláinte nó Sochar Breoiteachta a fháil:

source: • Keep your existing payment
ga: • Coimeádfaidh tú d’íocaíocht reatha

source: • Be entitled to apply for both the maintenance and fee components of the student grant and a postgraduate fee contribution (if relevant). (Note that applicants on social welfare payments do not automatically qualify for a grant)
ga: • Beidh tú i dteideal iarratas a dhéaanmh ar chomhábhair chothabhála agus tháillí den deontas mac léinn (Nóta: Ní cháilítear iarratasóirí ar íocaíochtaí leasa shóisialaigh go huathoibríoch le haghaidh deontais)

source: • In general, lose your Rent Supplement, because you are in full-time education • Note that if your course requires you to travel abroad for an Erasmus year, your primary payment will not continue to be paid while abroad
ga: • Go ginearálta, caillfidh tú d’Fhorlíonadh Cíosa nó d’Forlíonadh Ús Morgáiste, de bharr go bhfuil tú ag plé le hoideachas lánaimseartha

source: If you have a medical card, you are entitled to retain it for a period of 3 years from the date of entry to full-time education, after which you will be re-assessed
ga: Má tá cárta leighis agat, beidh tú i dteideal é a choimeád ar feadh tréimhse 3 bliana ó dháta iontrála an oideachais lánaimseartha, agus déanfar thú a athmheasúnú ina dhiaidh seo

source: If you are currently getting the One-Parent Family Payment, changes in your family circumstances while you are in full-time education might affect your eligibility for the payment (for example, if a child no longer lives with you or goes over the age limit)
ga: Má tá an Íocaíocht Teaghlach Aontuismitheora á fáil agat faoi láthair, d’fhéadfadh athruithe ar do chúinsí teaghlaigh fad a bhíonn tú ag plé le hoideachas lánaimseartha tionchar a imirt ar do theidlíocht chun an íocaíocht a fháil (mar shampla, mura gcónaíonn leanbh leat a thuilleadh nó má sháraíonn siad an aoisteorainn)

source: You should factor any such changes into your planning for income support during your course
ga: Má aistríonn tú chuig an BTEA, tá d'íocaíocht faoi ráthaíocht le haghaidh fhad do chúrsa

source: From 4 July 2013, if you had opted to stay on your OFP and go back to education but no longer qualify for OFP due to changes in the ages limits you may be admitted to BTEA ‘mid course’
ga: Ba cheart duit aon athruithe den chineál sin a chur san áireamh agus pleanáil á déanamh agat ar thacaíocht ioncaim le linn do chúrsa

source: There is a special arrangement for people whose OFP claim ended on 2 July 2015
ga: Daoine a fhaigheann Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist

source: If you are getting Jobseeker's Allowance (JA) or Jobseeker's Benefit (JB), you must transfer to BTEA to keep a social welfare payment (including secondary benefits) during full-time education
ga: Má tá Liúntas Cuardaitheora Poist (JA) nó Sochar Cuardaitheora Poist (JB) á fháil agat, ní mór duit aistriú chuig an BTEA chun íocaíocht leasa shóisialaigh a choimeád (lena n-áirítear sochair thánaisteacha) le linn oideachas lánaimseartha

source: The reason for this is that you cannot be genuinely available for and seeking employment when participating in full-time education
ga: Is í an chúis atá leis seo, nach féidir fáil bheith ort agus nach féidir leat fostaíocht bheith á cuardach agat, i ndáiríre, agus páirt á glacadh agat in oideachas lánaimseartha

source: Since the 2016/2017 academic year, people getting BTEA who take up work during the academic year will be assessed under the rules (including means assessment) that apply to their primary payment - the payment they qualified for BTEA from
ga: Má cháilítear thú don Liúntas um Fhilleadh ar Oideachas, is féidir leat do theidlíocht i leith aon sochar tánaisteach atá agat cheana féin a choiméad, mar shampla, Liúntas Breosla, Forlíonadh Cíosa agus Forlíonadh Ús Morgáiste

source: This only applies new applicants or people who return to BTEA after a break. Previously part-time work during the academic year did not affect the rate of BTEA paid
ga: Ní imreoidh obair ar luach saothair tionchar ar d'íocaíocht BTEA ach d’fhéadfadh aon ioncam breise tionchar a imirt ar do shochair thánaisteacha

source: Once you transfer from JA or JB to the BTEA, you are not eligible for the maintenance component of the student grant but you can apply for a fee grant – covering the student contribution, field trip costs and fees (if payable) under the student grant scheme. You should do this as soon as possible. People coming from jobseeker’s payments or Farm Assist are paid BTEA for the academic year only and not for the summer months between academic years
ga: A luaithe a aistríonn tú ón LCP nó ón SCP chuig an BTEA, ní bheidh tú i dteideal an comhábhar cothabhála den deontas mac léinn a fháil ach is féidir leat iarratas a dhéanamh ar dheontas táillí – a íocfaidh as ranníocaíocht an mhic léinn, as costais tuaras allamuuigh agus as táillí (más iníoctha dóibh) trí leas a bhaint as an bhfoirm le haghaidh an deontais mhac léinn

source: Signing on for credits only and the student grant
ga: Ba cheart duit é seo a dhéanamh a luaithe is féidir

source: The following case studies show the options available to people on different types of social welfare payments and the advantages and disadvantages of each option
ga: Leagadh amach na cás-staidéir seo a leanas chun léiriú níos fearr a thabhairt ar na roghanna atá ar fáil do dhaoine atá ar chineálacha éagsúla íocaíochtaí leasa shóisialaigh agus ar na buntáistí agus na míbhuntáistí a bhaineann le gach rogha díobh

source: A: I’m getting Jobseeker’s Allowance and starting a full-time course in further or higher education:
ga: A: Tá Liúntas Cuardaitheora Poist á fháil agam agus táim ag tosú ar chúrsa lánaimseartha breisoideachais nó ardoideachais:

source: You cannot get Jobseeker’s Allowance (JA) and attend full-time education
ga: Ní féidir leat Liúntas Cuardaitheora Poist a fháil agus tú ag freastal go lánaimseartha ar oideachas

source: If you are getting Jobseeker’s Allowance you should apply for the Back to Education Allowance (BTEA)
ga: Má tá Liúntas Cuardaitheora Poist á fháil agat ba cheart duit cur isteach ar an Liúntas um Fhilleadh ar an Oideachas (LFO)

source: If you qualify, your rate of payment on BTEA will be the same as the payment you were getting (if you were getting an age-related reduced rate of JA you get a standard BTEA rate of €160) and you will keep any secondary benefits you are getting
ga: Má tá tú incháilithe gheobhaidh tú LFO ar an ráta céanna agus uasráta an Liúntais Chuardaitheora Poist agus féadfaidh tú aon sochair thánaisteacha a bhíodh agat a choinneáil

source: You do not get the maintenance component of the student grant with BTEA, but you will be financially better off on BTEA than you would be on the maintenance grant alone
ga: Má athraíonn tú ó ráta laghdaithe Liúntais Chuardaitheora Poist go ráta uasta an Liúntais sin d’fhéadfadh sé tionchar a bheith aige ar an bhForlíonadh Cíosa nó ar an bhForlíonadh Ús Morgáiste atá á fháil agat

source: You must still apply to be assessed for the fee component of the student grant, covering the student contribution and any tuition fees or essential field trip costs and for a postgraduate fee contribution (if relevant)
ga: Beidh ort iarratas a dhéanamh fós chuig d’údarás áitiúil nó do Choiste Gairmoideachais le go ndéanfar measúnú ort i gcomhair na táille seirbhísí mac léinn agus na dtáillí teagaisc

source: You should submit your application immediately
ga: Ba chóir duit d’iarratas a chur isteach láithreach

source: B: I’m getting a One-Parent Family Payment and starting a full-time course in further or higher education:
ga: B: Tá Íocaíocht do Theaghlach Aon-Tuismitheora á fháil agam agus táim ag tosú ar chúrsa lánaimseartha breisoideachais nó ardoideachais:

source: If you are getting a One-Parent Family Payment you have two options and you need to work out which will give you the higher income
ga: Tá dhá rogha agat má tá Íocaíocht do Theaghlach Aon-Tuismitheora á fháil agat agus caithfidh tú a dhéanamh amach cé acu a thabharfaidh an t-ioncam is airde duit

source: You can stay on your One-Parent Family Payment and apply for a student grant
ga: Feadfaidh tú an Íocaíocht do Theaghlach Aon-Tuismitheora atá á fháil agat a choinneáil agus cur isteach ar dheontas cothaithe

source: If you choose this option you will continue to get your One-Parent Family Payment at your current rate and may qualify for the student grant
ga: Má thograíonn tú é sin a dhéanamh leanfaidh tú ort ag fáil na hÍocaíochta do Theaghlach Aon-Tuismitheora ar do ráta reatha agus d’fheadfá a bheith incháilithe chun deontas cothaithe a fháil

source: However, you will lose any secondary benefits you are getting such as Rent Supplement or Mortgage Interest Supplement
ga: Caillfidh tú aon sochar tánaisteach atá á fháil agat, áfach, mar Fhorlíonadh Cíosa nó Fhorlíonadh Ús Morgáiste

source: You can transfer from your One-Parent Family Payment to the BTEA
ga: D’fhéadfá aistriú ón Íocaíocht do Theaghlach Aon-Tuismitheora go dtí an LFO

source: If you choose this option and qualify for BTEA, you will not get the maintenance component of the student grant
ga: Má thograíonn tú é sin a dhéanamh agus má tá tú incháilithe chun an LFO a fháil ní bhfaighidh tú aon deontas cothaithe

source: Your rate of payment on BTEA will be the same as the rate of One-Parent Family Payment you were getting and you can keep any secondary benefits you may be getting
ga: Gheobhaidh tú an LFO ar an ráta céanna agus uasráta na hÍocaíochta do Theaghlach Aon-Tuismitheora agus féadfaidh tú aon sochar tánaisteach atá á fháil agat a choinneáil

source: You must still apply to be assessed for the fee component of the student grant, covering the student contribution and any tuition fees/essential field trip costs and for a postgraduate fee contribution (if relevant)
ga: Beidh ort an fhoirm iarratas i gcomhair deontais chothaithe a úsáid chun iarratas a dhéanamh chuig d’údarás áitiúil nó chuig do Choiste Gairmoideachais chun go ndéanfar measúnú ort ó thaobh na táille seirbhísí mac léinn agus na dtáillí teagaisc

source: C: I’m getting a Disability Allowance and starting a full-time course in further or higher education:
ga: C: Tá Liúntas Míchumais á fháil agam agus táim ag tosú ar chúrsa lánaimseartha breisoideachais nó ardoideachais:
